## Plan Result (prod)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_definition.custom_roles[&#34;DocumentDBReadWrite&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_definition.custom_roles["DocumentDBReadWrite"] will be created
  + resource "azurerm_role_definition" "custom_roles" {
      + assignable_scopes           = (known after apply)
      + description                 = "Custom role for DocumentDB with specific permissions"
      + id                          = (known after apply)
      + name                        = "DocumentDBReadWrite"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/providers/Microsoft.Management/managementGroups/HMCTS"

      + permissions {
          + actions     = [
              + "Microsoft.DocumentDB/databaseAccounts/readMetadata",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/*",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/items/*",
            ]
          + not_actions = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":70,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->